tutorials/multiphase/interPhaseChangeFoam/cavitatingBullet/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (-15 -15 -15)
    (15 -15 -15)
    (15  15 -15)
    (-15  15 -15)
    (-15 -15 100)
    (15 -15 100)
    (15  15 100)
    (-15  15 100)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (15 15 50) simpleGrading (1 1 1)
);

patches
(
    patch inlet
    (
        (0 3 2 1)
    )
    patch outlet
    (
        (4 5 6 7)
    )
    symmetryPlane walls
    (
        (0 4 7 3)
        (2 6 5 1)
        (1 5 4 0)
        (3 7 6 2)
    )
);


// ************************************************************************* //
